---
kind: method
id: M:Autodesk.Revit.DB.FormArrayIterator.#ctor
source: html/c1105358-88ff-e5c1-e61f-503859ed6b48.htm
---
# Autodesk.Revit.DB.FormArrayIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public FormArrayIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.